# ============================================================
# Задача 2.3. Размен монет
# ============================================================
# Дана сумма в копейках. Определите минимальное количество
# монет номиналом 1, 5, 10, 50 копеек, чтобы выдать эту сумму.
#
# Пример:
#   In: 87
#   Out:
#     50: 1
#     10: 3
#     5: 1
#     1: 2
#
# Подсказка: используйте целочисленное деление // и остаток %
# последовательно для каждого номинала.

def coin_change(amount: int) -> dict:
    money = amount

    pyatdesyat = money//50
    money = money % 50
    desyat = money//10
    money = money % 10
    pyat = money // 5
    money = money % 5
    odin = money // 1
    return {50: pyatdesyat, 10: desyat, 5: pyat, 1: odin}
