# ============================================================
# Задача 3.1. Ввод с проверкой (моржовый оператор)
# ============================================================
# Запросите у пользователя число. Используя моржовый оператор (:=),
# сохраните результат в переменную прямо внутри условия if
# и проверьте, что число положительное.
#
# Пример:
#   In: 5
#   Out: Положительное: 5
#
#   In: -3
#   Out: Не положительное
#
# Подсказка:
#   if (n := int(input())) > 0:
#       print(f"Положительное: {n}")
#   else:
#       print("Не положительное")

def check_positive():
    if (a := int(input()))>0:
        print(f"Положительное: {a}")
    else:
        print(f"Не положительное")
    return
